AcGiToneOperatorParameters.copyFrom(AcRxObject!System.Runtime.CompilerServices.IsConst*)
Copies member data from source object
Returns:
Acad::eOk if copy is successful

AcGiToneOperatorParameters.exteriorDaylight
Is exterior daylight enabled?
Returns:
True if exterior daylight is enabled.
Remarks:
Only applies if the tone operator is active.

AcGiToneOperatorParameters.setExteriorDaylight(AcGiToneOperatorParameters.ExteriorDaylightMode)
Indicates whether or not exterior daylight is enabled.
mode:
If kDaylightOff, daylight is disabled. If kDaylightOn, daylight is enabled.  If kDaylightAuto, exterior daylight is enabled if a sky background or a sun light is enabled.
Returns:
Returns true if a valid exterior daylight mode is passed in.
Remarks:
This value only applies if the tone operator is active.

AcGiToneOperatorParameters.midTones
The mid tones for the tone operator.
Returns:
The mid tones for the tone operator.
Remarks:
Only applies if the tone operator is active.

AcGiToneOperatorParameters.setMidTones(System.Double)
Sets the mid tones for the tone operator.
midTones:
The mid tones for the tone operator.
Returns:
Returns true if a valid midtones value is passed in.
Remarks:
This value only applies if the tone operator is active.

AcGiToneOperatorParameters.contrast
The contrast for the tone operator.
Returns:
The contrast for the tone operator.
Remarks:
Only applies if the tone operator is active.

AcGiToneOperatorParameters.setContrast(System.Double)
Sets the contrast for the tone operator.
contrast:
The contrast for the tone operator.
Returns:
Returns true if a valid contrast value is passed in.
Remarks:
This value only applies if the tone operator is active.

AcGiToneOperatorParameters.brightness
The brightness for the tone operator.
Returns:
The brightness for the tone operator.
Remarks:
Only applies if the tone operator is active.

AcGiToneOperatorParameters.setBrightness(System.Double)
Sets the brightness for the tone operator.
brightness:
The brightness for the tone operator.
Returns:
Returns true if a valid brightness value is passed in.
Remarks:
This value only applies if the tone operator is active.

AcGiToneOperatorParameters.processBackground
Is background processing enabled?
Returns:
True if background processing is enabled.
Remarks:
Only applies if the tone operator is active.

AcGiToneOperatorParameters.setProcessBackground(System.Boolean)
Specifies if the background should be processed by exposure control at render time.
processBG:
Set to true to enable background processing, otherwise false.
Remarks:
Only applies if the tone operator is active.

AcGiToneOperatorParameters.whiteColor
Gets the reference white color

AcGiToneOperatorParameters.setWhiteColor(AcCmColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets the reference white color
color: Reference White

AcGiToneOperatorParameters.colorDifferentiation
Reserved for future use.

AcGiToneOperatorParameters.setColorDifferentiation(System.Boolean)
Reserved for future use.

AcGiToneOperatorParameters.chromaticAdaptation
Reserved for future use.

AcGiToneOperatorParameters.setChromaticAdaptation(System.Boolean)
Reserved for future use.

AcGiToneOperatorParameters.isActive
Is the tone operator active?
Returns:
True if the tone operator is active.

AcGiToneOperatorParameters.setIsActive(System.Boolean)
Indicates whether or not the tone operator is active.
active:
If true, the tone operator is active.

AcGiToneOperatorParameters
Container class for all tone operator parameters.